Create a Pandas DataFrame from a dictionary of lists.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name" : ["Bipin", "Ram", "Sham", None],
    "Age" : [24,25,21,27]
})
df

    Name  Age
0  Bipin   24
1    Ram   25
2   Sham   21
3   None   27

Read a CSV file into a DataFrame and display the first 5 rows.

In [3]:
data = pd.read_csv("sampledata.csv")
data.head()

   Column1  Column2 Column3  Column4  Column5
0        1       78       A    -0.61    False
1        2       94       C    -0.90     True
2        3       59       B    -0.17     True
3        4       32       C    -2.74    False
4        5       65       B     1.14     True

Get the number of rows and columns of a DataFrame.

In [4]:
rows, columns = data.shape # shape returns tuple so here we are unpacking the tuple
print(f"Rows : {rows}")
print(f"Columns : {columns}")

Rows : 10
Columns : 5

Display all column names and their data types.

In [5]:
print(data.dtypes)

Column1      int64
Column2      int64
Column3     object
Column4    float64
Column5       bool
dtype: object

Select a single column ('Name') and multiple columns ('Name', 'Age') from a DataFrame.

In [6]:
print(df[["Name","Age"]])

    Name  Age
0  Bipin   24
1    Ram   25
2   Sham   21
3   None   27

Select the first 3 rows using iloc.

In [7]:
data.iloc[:3]

   Column1  Column2 Column3  Column4  Column5
0        1       78       A    -0.61    False
1        2       94       C    -0.90     True
2        3       59       B    -0.17     True

Find missing values in a DataFrame.

In [8]:
df.isnull().sum()

Name    1
Age     0
dtype: int64

Replace all NaN values with "Unknown".

In [9]:
df.fillna("unknown", inplace = True)
print(df.isnull().sum())
print(df)

Name    0
Age     0
dtype: int64
      Name  Age
0    Bipin   24
1      Ram   25
2     Sham   21
3  unknown   27

Sort the DataFrame by the 'Age' column in descending order.

In [10]:
df.sort_values(by='Age', ascending=False, inplace = True)
df

      Name  Age
3  unknown   27
1      Ram   25
0    Bipin   24
2     Sham   21

Group the DataFrame by 'Department' and calculate the average salary.

In [11]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Dana'],
    'Department': ['HR', 'IT', 'HR', 'IT'],
    'Salary': [50000, 60000, 55000, 65000]
})

df.groupby('Department')['Salary'].mean()

Department
HR    52500.0
IT    62500.0
Name: Salary, dtype: float64